[
  {
    "sign": "Virgo",
    "horoscope": "Family affairs will predominate today. They will even control your thoughts to the exclusion of everything else. Things will look up on the business front. You may spend time relaxing in the evening. Ganesha says a trip to a place of worship is on the cards."
  },
  {
    "sign": "Libra",
    "horoscope": "Ganesha says today is a good day to renovate your home. You will be able to decorate your home artistically because of your designing skills. The atmosphere at your home will be a happy one with the arrival of guests. You will make plans to go for a picnic with close friends or relatives. Ganesha wishes you all the very best for your future."
  },
  {
    "sign": "Scorpio",
    "horoscope": "Just another mundane day in store for you. At work, pressure may mount and lead to a hectic and tedious day. You may even feel irritated at times. Thus, feeling the need to unwind, you may invite your sweetheart for the cup of coffee and spend quality time together."
  },
  {
    "sign": "Sagittarius",
    "horoscope": "Tough times do not last, but tough people do, remember this fact and move ahead in life. Try to make the complicated life simpler by your optimistic approach. Speak up when it is required and don't get bogged down by unnecessary pressure."
  },
  {
    "sign": "Capricorn",
    "horoscope": "Often, sentiments take over your mind. Making you impractical, at times, this tendency proves to be harmful for you. Don't show it on your face as others may take advantage of your weakness, advises Ganesha. If you don't control your emotions, it may become an obstacle in your path to success. Be strong and give a tough fight to those who want to go ahead of you."
  },
  {
    "sign": "Aquarius",
    "horoscope": "Flash warning signals to your arch rivals as you will be in a mood to prove you metal and give them a run for their money. Doubts and inhibitions – all will vanish in the air and you will be determined to make your mark, feels Ganesha. While on your path to success you will wins the hearts of one and many."
  },
  {
    "sign": "Pisces",
    "horoscope": "Today your intellectual streak comes to the fore. You will indulge your curiosity and take interest in natural phenomenon. Your faith will help you complete all your pending tasks with ease. You will leave things to destiny. You will be more inclined to intellectual pursuits rather than professional, however, do not neglect your responsibilities, says Ganesha."
  },
  {
    "sign": "Aries",
    "horoscope": "Today you will feel mushy and forlorn. Ganesha says you will make special efforts to strengthen your relationships. You look upon commitment as a security for the future. As a result, you will develop strong, long-term bondings."
  },
  {
    "sign": "Taurus",
    "horoscope": "Things will tend to get very difficult and complicated, says Ganesha Be prepared for setbacks and challenges today. No matter how big the issue, your competence, your resourcefulness will see you through. Try to remain focused and alert. Be cautious and circumspect. Act coolly and sensibly. That is all that you need. No predicament or dilemma or predicament will hold you back. You will come out with flying colours"
  },
  {
    "sign": "Gemini",
    "horoscope": "You will spend your day fulfilling the demands made upon you by your family members and colleagues. You will need to devote time to matters at home. Pay attention to the needs of your relatives for they will be helpful to you in the near future, says Ganesha."
  },
  {
    "sign": "Cancer",
    "horoscope": "A wondrous beginning of the day! A unique vibrations in romantic life. Ties with life partnerwill be cordial. Blissful moments of married life are indicated. Peace and happiness prevail in the family. The whole day will be blooming and jovial, says Ganesha."
  },
  {
    "sign": "Leo",
    "horoscope": "Financial gains in shares and stocks are indicated. If you are an investor, your investments will yield substantial profits. Long-standing debts are also likely to be cleared, and pending dues will be settled. Expenses for the purposes of entertainment are a possibility, says Ganesha."
  }
]
